Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/whatsnew.tmx
Source language: en
Languages: pt

source: What's New in Python 2.0
pt: O que há de novo no Python 2.0

source: Author
pt: Autor

source: Introduction
pt: Introdução

source: A new release of Python, version 2.0, was released on October 16, 2000. This article covers the exciting new features in 2.0, highlights some other useful changes, and points out a few incompatible changes that may require rewriting code.
pt: Uma nova versão de Python, a versão 2.0, foi lançada em 16 de Outubro de 2000. Esse artigo cobre as excitantes novas características nessa versão, dá ênfase a algumas outras mudanças úteis, e aponta algumas mudanças incompatíveis que podem necessitar de reescrita de código.

source: New Development Process
pt: Novo Processo de Desenvolvimento

source: The largest new feature in Python 2.0 is a new fundamental data type: Unicode strings. Unicode uses 16-bit numbers to represent characters instead of the 8-bit number used by ASCII, meaning that 65,536 distinct characters can be supported.
pt: A maior nova característica em Python 2.0 é um novo tipo fundamental de dado: strings Unicode. O Unicode utiliza números de 16 bits para representar caracteres ao invés do número de 8 bits usado por ASCII, o que significa que 65.536 caracteres distintos podem ser representados.

source: The final interface for Unicode support was arrived at through countless often- stormy discussions on the python-dev mailing list, and mostly implemented by Marc-André Lemburg, based on a Unicode string type implementation by Fredrik Lundh. A detailed explanation of the interface was written up as :pep:`100`, "Python Unicode Integration". This article will simply cover the most significant points about the Unicode interfaces.
pt: A interface final para o suporte à Unicode foi alcançada através de incontáveis e às vezes turbulentas discussões na lista de e-mails python-dev, com sua maioria tendo sido implementada por Marc-André Lemburg, com base em uma implementação de tipo de string Unicode de Fredrik Lundh. Uma explicação detalhada da interface foi escrita como :pep:`100`, "Python Unicode Integration" - o que poderia ser traduzido como "Integração de Unicode Python". Este artigo simplesmente cobrirá os pontos mais significantes sobre as interfaces Unicode.

source: For example, the following code writes a Unicode string into a file, encoding it as UTF-8::
pt: Por exemplo, o seguinte código escreves uma string em Unicode em um arquivo, codificando-se como UTF-8::

source: Because of Python's scoping rules, a default argument is used so that the anonymous function created by the :keyword:`lambda` statement knows what substring is being searched for. List comprehensions make this cleaner::
pt: Por causa das regras de escopo de Python, um argumento padrão é usada para que a função anônima criada pelo comando :palavra-chave:`lambda` saiba qual substring está sendo procurada. Compreensões de lista tornam isso mais limpo::
